Documents/ПереоценкаТоваровВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПереоценкаТоваровВРознице</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УдалитьТоварыВНТТВПродажныхЦенахНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВНТТВПродажныхЦенах</xr:Item>
				<xr:Item>InformationRegister.ЦеныАТТ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВНТТ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановкиЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПереоценкаТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВРозницеСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВРознице</Name>
							<Comment>Розничная цена в розничной торговле, цена продажи при поступлении на комиссию по "жесткой" схеме</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСВРознице</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПереоценки</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтатьяПриростаУбылиЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныАТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАТТ</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРознице</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВНТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВНТТ</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦенаВРознице</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВНТТВПродажныхЦенах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВНТТВПродажныхЦенах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>(грн)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНаценки</Name>
					<Comment>(грн)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийТоварыВНТТВПродажныхЦенах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПереоценкаТоваровВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПереоценкаТоваровВРознице</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВРознице</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВНТТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РазделыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РазделыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОценкаМПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оптовый</Name>
					<Comment>(Общ) Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розничный</Name>
					<Comment>(Общ) Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НТТ</Name>
					<Comment>(Общ) Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПереоценкаТоваровВРознице/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мУчетнаяПолитикаБУ Экспорт;
Перем мУчетнаяПолитикаНУ Экспорт;
Перем мИспользоватьОборотнуюНоменклатуру Экспорт;
Перем мРазделятьПоСтавкамНДС Экспорт;

Перем мУдалятьДвижения;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА


#Если Клиент Тогда

// Функция осуществляет печать этикеток для позиций ТЧ
//
// Параметры
//  Нет
//
Процедура ПечататьЭтикетки()

	Если ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ Тогда
		УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка, "ЦенаВРознице");
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("СписокХарактеристик", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Валюта", мВалютаРегламентированногоУчета);

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТоварыВРознице.Номенклатура КАК Номенклатура,
		|	Остатки.КоличествоОстаток КАК Количество,
		|	ТоварыВРознице.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ТоварыВРознице.СерияНоменклатуры КАК Серия,
		|	ТоварыВРознице.Качество КАК Качество,
		|	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	Док.ЦенаВРознице КАК Цена,
		|	&Валюта КАК Валюта,
		|	РегШК.ТипШтрихкода КАК ТипШтрихкода,
		|	РегШК.ПредставлениеШтрихкода КАК ПредставлениеШтрихкода,
		|	РегШК.Штрихкод КАК Штрихкод
		|ИЗ
		|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Характеристики.Ссылка КАК Ссылка,
		|		Характеристики.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
		|	ГДЕ
		|		Характеристики.Владелец В (&СписокНоменклатуры)
		|		И Характеристики.Ссылка НЕ В (&СписокХарактеристик)
		|		И Характеристики.Ссылка НЕ В (
		|			ВЫБРАТЬ
		|				ЦеныПродажные.ХарактеристикаНоменклатуры
		|			ИЗ
		|				РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата,
		|				   Номенклатура В (&СписокНоменклатуры)) КАК ЦеныПродажные
		|		)
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
		|		Номенклатура.Ссылка КАК Владелец
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|	ГДЕ
		|		Номенклатура.Ссылка В (&СписокНоменклатуры)
		|	) КАК Характеристики
		|ПО
		|	Док.Номенклатура = Характеристики.Владелец
		|	И Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыВРознице.Остатки(&Дата, Склад = &Склад И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
		|ПО
		|	Док.Номенклатура = Остатки.Номенклатура
		|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыВРознице КАК ТоварыВРознице
		|ПО
		|	Док.Ссылка = ТоварыВРознице.Регистратор
		|	И Док.Номенклатура = ТоварыВРознице.Номенклатура
		|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = ТоварыВРознице.ХарактеристикаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Штрихкоды КАК РегШК
		|ПО
		|	РегШК.Владелец = ТоварыВРознице.Номенклатура
		|	И РегШК.ЕдиницаИзмерения = ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков
		|	И РегШК.ХарактеристикаНоменклатуры = ТоварыВРознице.ХарактеристикаНоменклатуры
		|	И РегШК.СерияНоменклатуры = ТоварыВРознице.СерияНоменклатуры
		|	И РегШК.Качество = ТоварыВРознице.Качество
		|ГДЕ
		|	Док.Ссылка = &ДокСсылка
		|";

		Запрос.Текст = ТекстЗапроса;

		УправлениеРозничнойТорговлей.ПечатьЭтикеток(Запрос.Выполнить().Выгрузить());
	КонецЕсли;

КонецПроцедуры // ПечататьЭтикетки()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьПереоценкиТоваровВРознице()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СписокХарактеристик", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.Ссылка.Номер,
	               |	Док.Ссылка.Дата,
	               |	Док.Ссылка.Организация,
	               |	Док.Ссылка.Организация КАК Поставщик,
	               |	Док.Ссылка.Склад КАК Получатель,
	               |	Док.Ссылка.Склад.Представление КАК ПредставлениеПолучателя,
	               |	ТоварыВРознице.НомерСтроки,
	               |	Остатки.КоличествоОстаток КАК Количество,
	               |	ТоварыВРознице.Номенклатура,
	               |	ТоварыВРознице.Номенклатура.НаименованиеПолное КАК Товар,
	               |	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	               |	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	               |	Остатки.СуммаПродажнаяОстаток / Остатки.КоличествоОстаток КАК ЦенаВРозницеСтарая,
	               |	Док.ЦенаВРознице,
	               |	ТоварыВРознице.СуммаПродажная КАК ОтклонениеСтоимости,
	               |	ТоварыВРознице.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	ТоварыВРознице.СерияНоменклатуры КАК Серия
	               |ИЗ
	               |	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Характеристики.Ссылка КАК Ссылка,
	               |			Характеристики.Владелец КАК Владелец
	               |		ИЗ
	               |			Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	               |		ГДЕ
	               |			Характеристики.Владелец В(&СписокНоменклатуры)
	               |			И (НЕ Характеристики.Ссылка В (&СписокХарактеристик))
	               |			И (НЕ Характеристики.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ЦеныПродажные.ХарактеристикаНоменклатуры
	               |						ИЗ
	               |							РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата, Номенклатура В (&СписокНоменклатуры)) КАК ЦеныПродажные))
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			&ПустаяХарактеристика,
	               |			Номенклатура.Ссылка
	               |		ИЗ
	               |			Справочник.Номенклатура КАК Номенклатура
	               |		ГДЕ
	               |			Номенклатура.Ссылка В(&СписокНоменклатуры)) КАК Характеристики
	               |		ПО Док.Номенклатура = Характеристики.Владелец
	               |			И (Док.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	               |		&Дата,
	               |		Склад = &Склад
	               |		    И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	               |		ПО Док.Номенклатура = Остатки.Номенклатура
	               |			И (ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице КАК ТоварыВРознице
	               |		ПО Док.Ссылка = ТоварыВРознице.Регистратор
	               |			И Док.Номенклатура = ТоварыВРознице.Номенклатура
	               |			И (ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = ТоварыВРознице.ХарактеристикаНоменклатуры)
	               |ГДЕ
	               |	Док.Ссылка = &ДокСсылка
	               |УПОРЯДОЧИТЬ ПО
	               |	ТоварыВРознице.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Предупреждение(НСтр("ru='Ни один товар не был переоценен.';uk='Жоден товар не був переоцінений.'"));
		Возврат Неопределено;
	КонецЕсли;

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПереоценкаТоваровВРознице_ПереоценкаТоваровВРознице";
	Макет = ПолучитьМакет("ПереоценкаТоваровВРознице");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Переоценка товаров в рознице';uk='Переоцінка товарів у роздробі'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);	
	ОбластьМакета.Параметры.РеквизитыПоставщика =     ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,",,КодЯзыкаПечать);
    ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогОтклонениеСтоимости = 0;
	ВыборкаСтрокТовары = Шапка;
	ВыборкаСтрокТовары.Сбросить();
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = ВыборкаСтрокТовары.Товар;
			
		ТабДокумент.Вывести(ОбластьМакета);
		ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости + ВыборкаСтрокТовары.ОтклонениеСтоимости;
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьПереоценкиТоваровВРознице()

// Функция формирует табличный документ с печатной формой переоценки в НТТ.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьПереоценкиТоваровВНТТ()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереоценкаТоваровВРознице.Номер,
	|	ПереоценкаТоваровВРознице.Дата,
	|	ПереоценкаТоваровВРознице.Организация,
	|	ПереоценкаТоваровВРознице.Организация КАК Поставщик,
	|	ПереоценкаТоваровВРознице.Склад КАК Получатель,
	|	ПереоценкаТоваровВРознице.Склад.Представление КАК ПредставлениеПолучателя,
	|	ПереоценкаТоваровВРознице.Склад.СуммовойУчет КАК СуммоваяРозница,
	|	ПереоценкаТоваровВРознице.Товары.(
	|		НомерСтроки,
	|		Количество,
	|		Номенклатура,
	|		ЕстьNULL(Номенклатура.НаименованиеПолное, """") КАК Товар,
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	|		Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|		ЦенаВРозницеСтарая,
	|		ЦенаВРознице,
	|		ВЫБОР
	|			КОГДА ПереоценкаТоваровВРознице.Товары.Ссылка.Склад.СуммовойУчет
	|				ТОГДА ПереоценкаТоваровВРознице.Товары.СуммаПереоценки
	|			ИНАЧЕ (ПереоценкаТоваровВРознице.Товары.ЦенаВРознице - ПереоценкаТоваровВРознице.Товары.ЦенаВРозницеСтарая) * ПереоценкаТоваровВРознице.Товары.Количество
	|		КОНЕЦ КАК ОтклонениеСтоимости,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	)
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице КАК ПереоценкаТоваровВРознице
	|ГДЕ
	|	ПереоценкаТоваровВРознице.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПереоценкаТоваровВРознице_ПереоценкаТоваровВРознице";
	Макет = ПолучитьМакет("ПереоценкаТоваровВРознице");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Переоценка товаров в рознице';uk='Переоцінка товарів у роздробі'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);	
	ОбластьМакета.Параметры.РеквизитыПоставщика =     ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "НомерСчета,Банк,МФО,/,ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,",,КодЯзыкаПечать);
    ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогОтклонениеСтоимости = 0;
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Товар) 
			И НЕ Шапка.СуммоваяРозница  = Истина Тогда
			Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = ВыборкаСтрокТовары.Товар + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ТабДокумент.Вывести(ОбластьМакета);

		ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости + ВыборкаСтрокТовары.ОтклонениеСтоимости;
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьПереоценкиТоваровВНТТ()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
    мВидОперацииНТТ = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ);
	мВидОперацииРозница = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);
	
	Если мВидОперацииРозница Тогда
		Если Не Проведен Тогда
			Предупреждение(НСтр("ru='Документ можно распечатать только после его проведения';uk='Документ можна роздрукувати тільки після його проведення'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПереоценкаТоваровВРознице" Тогда
		Если мВидОперацииНТТ Тогда
			ТабДокумент = ПечатьПереоценкиТоваровВНТТ();
		ИначеЕсли мВидОперацииРозница Тогда
			ТабДокумент = ПечатьПереоценкиТоваровВРознице();
		КонецЕсли;
	ИначеЕсли ИмяМакета = "Ценники" Тогда
		ТабДокумент = ПечатьЦенников();
	ИначеЕсли ИмяМакета = "Этикетки" Тогда
		ПечататьЭтикетки();
		Возврат;
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	
КонецПроцедуры // Печать()
 
// Процедура выполняет заполнение табличной части по остаткам.
//
Процедура ЗаполнитьТовары(РежимЗаполнения = "ЗаполнитьПоОстаткам") Экспорт
  
	Если РежимЗаполнения = "ЗаполнитьИзУстановкиЦен" Тогда
		
		Если НЕ ЗначениеЗаполнено(ДокументУстановкиЦен) Тогда
			Предупреждение(НСтр("ru='Не выбран документ установки цен!';uk='Не вибраний документ встановлення цін!'"));
			Возврат;
		КонецЕсли;

		ТипЦенРассчитывается = Склад.ТипЦенРозничнойТорговли.Рассчитывается;
		Если ТипЦенРассчитывается Тогда
			ТипЦен = Склад.ТипЦенРозничнойТорговли.БазовыйТипЦен;
		Иначе
			ТипЦен = Склад.ТипЦенРозничнойТорговли;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Запрос.УстановитьПараметр("Док",    ДокументУстановкиЦен);

		Запрос.Текст = "
		|ВЫБРАТЬ
		|	УстановкаЦен.Номенклатура КАК Номенклатура,
		|	УстановкаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	УстановкаЦен.Валюта				КАК Валюта,
		|	УстановкаЦен.Цена 				КАК Цена,
		|	УстановкаЦен.ЕдиницаИзмерения   КАК ЕдиницаИзмерения,
		|	УстановкаЦен.Номенклатура.ЕдиницаХраненияОстатков   КАК ЕдиницаХраненияОстатков
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦен
		|ГДЕ
		|	УстановкаЦен.Ссылка = &Док
		|	И УстановкаЦен.ТипЦен = &ТипЦен
		|	И НЕ УстановкаЦен.Номенклатура.Услуга
		|";

		Товары.Очистить();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			СтрокаТЧ = Товары.Добавить();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			
			Если ТипЦенРассчитывается Тогда
					
				Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура,
			                                                    СтрокаТЧ.ХарактеристикаНоменклатуры,
			                                                    Склад.ТипЦенРозничнойТорговли,
			                                                    ДокументУстановкиЦен.Дата, Выборка.ЕдиницаХраненияОстатков,
			                                                    мВалютаРегламентированногоУчета);
			
			Иначе
				
				Цена = Выборка.Цена;
				Цена = Ценообразование.ПересчитатьЦенуПриИзмененииЕдиницы(Цена, Выборка.ЕдиницаИзмерения, Выборка.ЕдиницаХраненияОстатков);
				Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, Выборка.Валюта, мВалютаРегламентированногоУчета, 1, 1);	
				Цена = Ценообразование.ОкруглитьЦену(Цена, Склад.ТипЦенРозничнойТорговли.ПорядокОкругления, Склад.ТипЦенРозничнойТорговли.ОкруглятьВБольшуюСторону);	
			
			КонецЕсли;
			
			СтрокаТЧ.ЦенаВРознице = Цена;
			
		КонецЦикла; 
		
	Иначе
		
		ДатаЦен = ?(НачалоДня(Дата) <> НачалоДня(ТекущаяДата()), Дата, '00010101');

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	Остатки.ЦенаВРознице,
		|	Остатки.ХарактеристикаНоменклатуры,
		|	Остатки.СерияНоменклатуры,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВНТТ.Остатки(&ДатаЦен,
		|	   Склад = &Склад) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток > 0
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.ЦенаВРознице,
		|	Остатки.ХарактеристикаНоменклатуры,
		|	Остатки.СерияНоменклатуры
		|";

		Выборка        = Запрос.Выполнить().Выбрать();
		ТипЦенСклада   = Склад.ТипЦенРозничнойТорговли;
		Валюта         = мВалютаРегламентированногоУчета;
		СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, Дата);
		Курс           = СтруктураКурса.Курс;
		Кратность      = СтруктураКурса.Кратность;

		Пока Выборка.Следующий() Цикл

			ДобавитьСтроку     = Истина;
			Номенклатура       = Выборка.Номенклатура;
			Характеристика     = Выборка.ХарактеристикаНоменклатуры;
			Серия              = Выборка.СерияНоменклатуры;
			Количество         = Выборка.КоличествоОстаток;
			ЦенаВРозницеСтарая = Выборка.ЦенаВРознице;

			Если РежимЗаполнения = "ЗаполнитьПоЦенам" Тогда
				ЦенаПоТипуЦен = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика, ТипЦенСклада,
				                						Дата, Номенклатура.ЕдиницаХраненияОстатков, Валюта, Курс, Кратность);

				Если ЦенаПоТипуЦен > 0
				   И ЦенаПоТипуЦен <> ЦенаВРозницеСтарая Тогда
					ЦенаВРознице = ЦенаПоТипуЦен;
				Иначе
					ДобавитьСтроку = Ложь;
				КонецЕсли;
			Иначе
				ЦенаВРознице = ЦенаВРозницеСтарая;
			КонецЕсли;

			Если ДобавитьСтроку Тогда
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Характеристика;
				СтрокаТабличнойЧасти.СерияНоменклатуры          = Серия;
				СтрокаТабличнойЧасти.Количество                 = Количество;
				СтрокаТабличнойЧасти.ЦенаВРозницеСтарая         = ЦенаВРозницеСтарая;
				СтрокаТабличнойЧасти.ЦенаВРознице               = ЦенаВРознице;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ЗаполнитьНалоговыеРеквизитыВТабЧастиТовары(ОтражатьВБухгалтерскомУчете);
	
КонецПроцедуры // ЗаполнитьТовары()


// Функция печатает ценники.
//
Функция ПечатьЦенников()

	Запрос = Новый Запрос("

	|ВЫБРАТЬ
	|	ИСТИНА КАК Печать,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Док.ЦенаВРознице КАК Цена,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Док
	|");


	Запрос.УстановитьПараметр("Док", Ссылка);

	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());


	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Открыть();

КонецФункции // ПечатьЦенников()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура("ПереоценкаТоваровВРознице", НСтр("ru='Переоценка товаров в рознице';uk='Переоцінка товарів у роздробі'"));
	СтруктураМакетов.Вставить("Ценники", НСтр("ru='Ценники на товары';uk='Цінники на товари'"));
	СтруктураМакетов.Вставить("Этикетки",  НСтр("ru='Этикетки';uk='Етикетки'"));

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация, СообщатьОбОшибке = Истина) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух", СообщатьОбОшибке);

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал", СообщатьОбОшибке);

	БУ = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ.ПолучитьОбъект();
	мИспользоватьОборотнуюНоменклатуру = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура, "ВидСубконто") = Неопределено, Ложь, Истина);
	мРазделятьПоСтавкамНДС  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС, "ВидСубконто") = Неопределено, Ложь, Истина);

КонецПроцедуры

// Заполняет реквизиты НалоговоеНазначение в строке табличной части.
Процедура ЗаполнитьНалоговыеРеквизитыВСтрокеТабЧасти(СтрокаТЧ, ЗаполнятьНУ) Экспорт
	
	Если ЗаполнятьНУ  = Истина Тогда
		
	    СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Организация, СтрокаТЧ.Номенклатура, Склад);
		
		СтрокаТЧ.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначение;
			
	ИначеЕсли ЗаполнятьНУ = Ложь Тогда
		
		СтрокаТЧ.НалоговоеНазначение 		= Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
			
	КонецЕсли;

КонецПроцедуры // ЗаполнитьНалоговыеРеквизитыВСтрокеТабЧасти()

// Заполняет реквизиты НалоговоеНазначение в строке табличной части.
Процедура ЗаполнитьНалоговыеРеквизитыВТабЧастиТовары(ЗаполнятьНУ) Экспорт
		
	Для Каждого СтрокаТЧ Из Товары Цикл
		ЗаполнитьНалоговыеРеквизитыВСтрокеТабЧасти(СтрокаТЧ, ЗаполнятьНУ) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНалоговыеРеквизитыВТабЧастиТовары()

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	МассивРазделовУчета.Добавить(Перечисления.РазделыУчета.ОценкаМПЗ);
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует таблицу товаров для переоценки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица значений, содержащая информацию для движений по переоценке.
//
Функция ПодготовитьТаблицуПереоценки()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ТекстЗапросаСписокНоменклатуры = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Номенклатура
	                                 |ИЗ
	                                 |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	                                 |ГДЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Ссылка = &ДокСсылка";
									 
	ТекстЗапросаСписокХарактеристик ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры
	                                 |ИЗ
	                                 |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	                                 |ГДЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Ссылка = &ДокСсылка";									 
	

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Склад КАК Склад,
	|	Док.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
	|	Остатки.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Остатки.Качество КАК Качество,
	|	Док.ЦенаВРознице * Остатки.КоличествоОстаток - Остатки.СуммаПродажнаяОстаток КАК СуммаПродажная
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		Характеристики.Ссылка КАК Ссылка,
	|		Характеристики.Владелец КАК Владелец
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|	ГДЕ
	|		Характеристики.Владелец В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Характеристики.Ссылка НЕ В (" + ТекстЗапросаСписокХарактеристик + ")
	|		И Характеристики.Ссылка НЕ В (
	|			ВЫБРАТЬ
	|				ЦеныПродажные.ХарактеристикаНоменклатуры
	|			ИЗ
	|				РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата,
	|				   Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")) КАК ЦеныПродажные
	|		)
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		&ПустаяХарактеристика КАК Ссылка,
	|		Номенклатура.Ссылка КАК Владелец
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.Ссылка В (" + ТекстЗапросаСписокНоменклатуры + ")
	|	) КАК Характеристики
	|ПО
	|	Док.Номенклатура = Характеристики.Владелец
	|	И Док.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	|СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРознице.Остатки(&Дата, Склад = &Склад И Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")) КАК Остатки
	|ПО
	|	Док.Номенклатура = Остатки.Номенклатура
	|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	Док.Ссылка = &ДокСсылка
	|	И Док.ЦенаВРознице * Остатки.КоличествоОстаток - Остатки.СуммаПродажнаяОстаток <> 0
	|";

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	ТаблицаПереоценки = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаПереоценки;

КонецФункции // ПодготовитьТаблицуПереоценки()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента);
	ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента);
	
	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

Процедура ПодготовитьТаблицуТоваровУпр(ТаблицаТоваров, СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ  Тогда
		ТаблицаТоваров.Колонки.Добавить("МинусКоличество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 3));

		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			СтрокаТаблицы.МинусКоличество = - СтрокаТаблицы.КоличествоДок;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПодготовитьТаблицуТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента)

	ТаблицаТоваров.Колонки.Добавить("Регистратор");
	ТаблицаТоваров.Колонки.Добавить("Организация");
	ТаблицаТоваров.Колонки.Добавить("СчетУчетаБУ");
	ТаблицаТоваров.Колонки.Добавить("КорСчетСписанияБУ");
	
	ТаблицаТоваров.ЗаполнитьЗначения(ЭтотОбъект,                              "Регистратор");
	ТаблицаТоваров.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,     "Организация");
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице Тогда
		ТаблицаТоваров.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ, "СчетУчетаБУ");
		ТаблицаТоваров.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ,       				  "КорСчетСписанияБУ");
	Иначе
		ТаблицаТоваров.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ, "СчетУчетаБУ");
		ТаблицаТоваров.ЗаполнитьЗначения(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ,	                      "КорСчетСписанияБУ");
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация, Склад");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ Тогда
		Если СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Документ не может осуществлять переоценку не на НТТ!';uk='Документ не може здійснювати переоцінку не на НТТ!'"), Отказ, Заголовок);
		КонецЕсли;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице Тогда
		Если СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.Розничный Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Документ не может осуществлять переоценку не на розничном складе!';uk='Документ не може здійснювати переоцінку не на роздрібному складі!'"), Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	НТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И НЕ СтруктураШапкиДокумента.СуммоваяРозница = Истина;
	СНТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И    СтруктураШапкиДокумента.СуммоваяРозница = Истина;
	АТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);
	
	// Укажем, что надо проверить:
	Если СНТТ Тогда
		СтруктураОбязательныхПолей = Новый Структура("СуммаПереоценки");
		Если мРазделятьПоСтавкамНДС Тогда
			СтруктураОбязательныхПолей.Вставить("СтавкаНДСВРознице");
		КонецЕсли;
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			СтруктураОбязательныхПолей.Вставить("НалоговоеНазначение");
		КонецЕсли; 
	ИначеЕсли АТТ Тогда
		СтруктураОбязательныхПолей = Новый Структура("Номенклатура, ЦенаВРознице");
	Иначе	
		СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЦенаВРозницеСтарая, ЦенаВРознице");
	КонецЕсли;

	Если мРазрешитьНулевыеЦеныВРознице И СтруктураОбязательныхПолей.Свойство("ЦенаВРознице") Тогда
		СтруктураОбязательныхПолей.Удалить("ЦенаВРознице");
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если Не СНТТ Тогда
		// Здесь услуг и бланков быть не должно.
		УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
    	УправлениеЗапасами.ПроверитьЧтоНетБланковСтрогогоУчета(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
		Если Не АТТ Тогда
			УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	Если АТТ Тогда
		// В табличной части не должно быть дублей строк
		ТаблицаПоТоварамКопия = ТаблицаПоТоварам.Скопировать();
		ТаблицаПоТоварамКопия.Свернуть("Номенклатура,ХарактеристикаНоменклатуры");
		
		Если ТаблицаПоТоварамКопия.Количество() < ТаблицаПоТоварам.Количество() Тогда
											
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='В табличной части имеются дубли строк! Проведение не возмжоно!';uk='У табличній частині є дублі рядків! Проведення не можливо!'"), Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	
	ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	
	ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И НЕ СтруктураШапкиДокумента.СуммоваяРозница;
	СНТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И    СтруктураШапкиДокумента.СуммоваяРозница;
	АТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);
		
	Если АТТ Тогда
		
		УправлениеЗапасамиПартионныйУчет.ВыполнитьПереоценку(ТаблицаПоТоварам);
		
	ИначеЕсли СНТТ Тогда
		
		ДатаДока   = Дата;
		ПроводкиБУ = Движения.Хозрасчетный;
		СчетУчета   = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
		СчетНаценки = ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ;
			
		Для Каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
			
			СуммаПереоценки = СтрокаТаблицы.СуммаПереоценки;
			
			Если СуммаПереоценки <> 0 Тогда
				
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.Дата;
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				Проводка.Содержание  = "Переоценка товаров в рознице";
				
				Проводка.СчетДт      = СчетУчета;
				Проводка.СчетКт      = СчетНаценки;
				
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады",  СтруктураШапкиДокумента.Склад);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады",  СтруктураШапкиДокумента.Склад);
				Если мИспользоватьОборотнуюНоменклатуру Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура",  СтрокаТаблицы.Номенклатура);
				КонецЕсли;
				
				Если мРазделятьПоСтавкамНДС Тогда
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтавкиНДС",  СтрокаТаблицы.СтавкаНДСВРознице);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтавкиНДС",  СтрокаТаблицы.СтавкаНДСВРознице);
				КонецЕсли;
				
				Проводка.Сумма       = СуммаПереоценки;
				
				Проводка.НалоговоеНазначениеДт = СтрокаТаблицы.НалоговоеНазначение;
				Проводка.НалоговоеНазначениеКт = СтрокаТаблицы.НалоговоеНазначение;
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
					Проводка.СуммаНУДт     = СуммаПереоценки;
					Проводка.СуммаНУКт     = Проводка.СуммаНУДт;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамУпр(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	НТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И НЕ СтруктураШапкиДокумента.СуммоваяРозница;
	СНТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ) И    СтруктураШапкиДокумента.СуммоваяРозница;
	АТТ = (СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);
	
	Если НТТ Тогда
		
		НаборДвижений = Движения.ТоварыВНТТ;

		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		ТаблицаПоТоварамРасход = ТаблицаПоТоварам.Скопировать();
		ТаблицаПоТоварамРасход.Колонки.Удалить("ЦенаВРознице");
		ТаблицаПоТоварамРасход.Колонки.ЦенаВРозницеСтарая.Имя = "ЦенаВРознице";
		ТаблицаПоТоварамРасход.Колонки.МинусКоличество.Имя = "Количество";

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРасход, ТаблицаДвижений);

		ТаблицаПоТоварамПриход = ТаблицаПоТоварам.Скопировать();
		ТаблицаПоТоварамПриход.Колонки.Удалить("ЦенаВРознице");
		ТаблицаПоТоварамПриход.Колонки.Цена.Имя = "ЦенаВРознице";
		ТаблицаПоТоварамПриход.Колонки.КоличествоДок.Имя = "Количество";

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамПриход, ТаблицаДвижений);

		// Недостающие поля.
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
		
	ИначеЕсли АТТ Тогда
		
		НаборДвижений = Движения.ЦеныАТТ;
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьДвижения();
		КонецЕсли;

		НаборДвижений = Движения.ТоварыВРознице;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПереоценки, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
		
	Иначе // СНТТ	
		
		НаборДвижений = Движения.ТоварыВНТТВПродажныхЦенах;
			
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		// Заполним таблицу движений.
		ТаблицаПоТоварамКопия = ТаблицаПоТоварам.Скопировать();
		
		Если мРазделятьПоСтавкамНДС Тогда

			ТаблицаПоТоварамКопия.Колонки.СтавкаНДСВРознице.Имя = "СтавкаНДС";
			
		КонецЕсли;
		
		ТаблицаПоТоварамКопия.Колонки.СуммаПереоценки.Имя = "СуммаНаценки";
		
		ТаблицаПоТоварамКопия.Колонки.Добавить("Сумма");
		ТаблицаПоТоварамКопия.ЗагрузитьКолонку(ТаблицаПоТоварамКопия.ВыгрузитьКолонку("СуммаНаценки"), "Сумма"); 
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамКопия, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийТоварыВНТТВПродажныхЦенах.Поступление, "КодОперации");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Склад, "Склад");
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрамУпр()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	
	Дата = Основание.Дата;
	Склад = Неопределено;
    ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице;
	ОтражатьВБухгалтерскомУчете 	= Истина;
	ОтражатьВУправленческомУчете 	= Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", Основание);
	Запрос.УстановитьПараметр("ВидСкладаРозничный", Перечисления.ВидыСкладов.Розничный);

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Док.Склад КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Склад.ВидСклада = &ВидСкладаРозничный
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
		|	Док.Склад КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ВозвратнаяТара КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Склад.ВидСклада = &ВидСкладаРозничный
		|";
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Док.Ссылка.СкладПолучатель КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Ссылка.СкладПолучатель.ВидСклада = &ВидСкладаРозничный
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
		|	Док.Ссылка.СкладПолучатель КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПеремещениеТоваров.ВозвратнаяТара КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Ссылка.СкладПолучатель.ВидСклада = &ВидСкладаРозничный
		|";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();

	ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Основание.Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
	                 													ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

	УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам);

	ТЗТовары = ТаблицаТоваров.НайтиСтроки(Новый Структура("СуммаПродажная", 0));

	СЗ = Новый СписокЗначений;

	Для Каждого СтрокаТовара Из ТЗТовары Цикл
		Если СЗ.НайтиПоЗначению(СтрокаТовара.Склад) = Неопределено Тогда
			СЗ.Добавить(СтрокаТовара.Склад);
		КонецЕсли;
	КонецЦикла;

	Если СЗ.Количество() = 0 Тогда
		Если ТаблицаТоваров.Количество() > 0 Тогда
			Склад = ТаблицаТоваров[0].Склад;
		КонецЕсли;

		Возврат;
	ИначеЕсли СЗ.Количество() = 1 Тогда
		Склад = СЗ[0].Значение;
	Иначе
		ВыбСклад = СЗ.ВыбратьЭлемент(НСтр("ru='Выберите склад';uk='Виберіть склад'"), СЗ[0]);

		Если ВыбСклад <> Неопределено Тогда
			Склад = ВыбСклад.Значение;
			ТЗТовары = ТаблицаТоваров.НайтиСтроки(Новый Структура("СуммаПродажная, Склад", 0, Склад));
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
   	
	Для Каждого СтрокаТовара Из ТЗТовары Цикл
		
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТовара);
		
		СтрокаТЧ.ЦенаВРознице = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура,
											   СтрокаТЧ.ХарактеристикаНоменклатуры, Склад.ТипЦенРозничнойТорговли, Дата,
											   СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков, мВалютаРегламентированногоУчета, 1, 1);
		
		
	КонецЦикла;;
	
КонецПроцедуры // ОбработкаЗаполнения()


// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();
	
	ОбновитьПараметрыУчетнойПолитики(Дата, Организация);
	
	Если НЕ мУчетнаяПолитикаНУ.ЕстьНДС Тогда
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Товары Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"          , "ВидСклада"                   ,   "ВидСклада");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"          , "СуммовойУчет"                ,   "СуммоваяРозница");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыльДо2015,ЕстьНДС");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"         , "СерияНоменклатуры");
	СтруктураПолей.Вставить("Услуга"      				, "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                  , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("БланкСтрогогоУчета"		, "Номенклатура.БланкСтрогогоУчета");
	СтруктураПолей.Вставить("КоличествоДок"	            , "Количество");
	СтруктураПолей.Вставить("ЦенаВРознице"		        , "ЦенаВРознице");
	СтруктураПолей.Вставить("Цена"                      , "ЦенаВРознице");
	СтруктураПолей.Вставить("ЦенаВРозницеСтарая"        , "ЦенаВРозницеСтарая");
	СтруктураПолей.Вставить("СтавкаНДСВРознице"         , "СтавкаНДСВРознице");
	СтруктураПолей.Вставить("СуммаПереоценки"	        , "СуммаПереоценки");
	СтруктураПолей.Вставить("Склад"				        , "Ссылка.Склад");
	СтруктураПолей.Вставить("НалоговоеНазначение"     		   , "НалоговоеНазначение");
    
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);

	ТаблицаПереоценки = ПодготовитьТаблицуПереоценки();

	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , "Покупка", ПараметрОбъектКопирования, ПараметрОснование);
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	#КонецЕсли
	
	Если ЗначениеЗаполнено(Склад) 
	   И Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
		Склад = Неопределено;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице Тогда
		ОтражатьВБухгалтерскомУчете 	= Истина;
		ОтражатьВУправленческомУчете 	= Истина;
	ИначеЕсли  Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ
		И НЕ Склад.СуммовойУчет Тогда
		ОтражатьВБухгалтерскомУчете = Ложь;
	КонецЕсли;

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Выполняет инициализацию нового документа и устанавливает вид операции ПереоценкаВНТТ.
// Вызывается из веб-приложения "Удаленный склад".
// 
Процедура ИнициализироватьНовыйДокументНТТ(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование);
	ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ;
	
	Если ЗначениеЗаполнено(Склад) И Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
		
		Склад = Справочники.Склады.ПустаяСсылка();
		
	КонецЕсли;

КонецПроцедуры // ИнициализироватьНовыйДокумент()
// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
	ОбновитьПараметрыУчетнойПолитики(Дата,Организация);
	
КонецПроцедуры // ПриИзмененииОрганизации()


мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

ОбновитьПараметрыУчетнойПолитики(Ссылка.Дата, Ссылка.Организация, Ложь);

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();
